{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/Relu6:0",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "Preprocessor__sub__0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/Relu6:0",
      "blob_weights" : 7,
      "K" : 32,
      "blob_biases" : 5,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_0\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/Relu6:0",
      "blob_weights" : 11,
      "K" : 32,
      "blob_biases" : 9,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/Relu6:0",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_1_pointwise\/Relu6:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/Relu6:0",
      "blob_weights" : 19,
      "K" : 64,
      "blob_biases" : 17,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/Relu6:0",
      "blob_weights" : 23,
      "K" : 128,
      "blob_biases" : 21,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_2_pointwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/Relu6:0",
      "blob_weights" : 27,
      "K" : 128,
      "blob_biases" : 25,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/Relu6:0",
      "blob_weights" : 31,
      "K" : 128,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_3_pointwise\/Relu6:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/Relu6:0",
      "blob_weights" : 35,
      "K" : 128,
      "blob_biases" : 33,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/Relu6:0",
      "blob_weights" : 39,
      "K" : 256,
      "blob_biases" : 37,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_4_pointwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/Relu6:0",
      "blob_weights" : 43,
      "K" : 256,
      "blob_biases" : 41,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/Relu6:0",
      "blob_weights" : 47,
      "K" : 256,
      "blob_biases" : 45,
      "stride_x" : 2,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_5_pointwise\/Relu6:0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/Relu6:0",
      "blob_weights" : 51,
      "K" : 256,
      "blob_biases" : 49,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/Relu6:0",
      "blob_weights" : 55,
      "K" : 512,
      "blob_biases" : 53,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_6_pointwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/Relu6:0",
      "blob_weights" : 59,
      "K" : 512,
      "blob_biases" : 57,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/Relu6:0",
      "blob_weights" : 63,
      "K" : 512,
      "blob_biases" : 61,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_7_pointwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/Relu6:0",
      "blob_weights" : 67,
      "K" : 512,
      "blob_biases" : 65,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/Relu6:0",
      "blob_weights" : 71,
      "K" : 512,
      "blob_biases" : 69,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_8_pointwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/Relu6:0",
      "blob_weights" : 75,
      "K" : 512,
      "blob_biases" : 73,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/Relu6:0",
      "blob_weights" : 79,
      "K" : 512,
      "blob_biases" : 77,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_9_pointwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/Relu6:0",
      "blob_weights" : 83,
      "K" : 512,
      "blob_biases" : 81,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/Relu6:0",
      "blob_weights" : 87,
      "K" : 512,
      "blob_biases" : 85,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/depthwise:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_10_pointwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0",
      "blob_weights" : 91,
      "K" : 512,
      "blob_biases" : 89,
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/BatchNorm\/batchnorm\/mul_1:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_depthwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0",
      "weights" : {

      },
      "mode" : 6,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0_neg",
      "type" : "activation",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0_neg",
      "beta" : 0
    },
    {
      "alpha" : -6,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0_neg",
      "operation" : 25,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0_clip",
      "type" : "elementwise",
      "name" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0_clip",
      "beta" : 0
    },
    {
      "alpha" : -1,
      "bottom" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0_clip",
      "weights" : {

      },
      "mode" : 6,
      "top" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0",
      "type" : "activation",
      "name" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BoxPredictor_0\/ClassPredictor\/BiasAdd:0",
      "blob_weights" : 95,
      "K" : 512,
      "blob_biases" : 93,
      "name" : "BoxPredictor_0\/ClassPredictor\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 273,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "name" : "BoxPredictor_0\/Reshape_1:0",
      "bottom" : "BoxPredictor_0\/ClassPredictor\/BiasAdd:0",
      "dst_n" : 0,
      "mode" : 1,
      "dst_seq" : 1,
      "dst_k" : 91,
      "weights" : {

      },
      "top" : "BoxPredictor_0\/Reshape_1:0",
      "dst_h" : 1,
      "dst_w" : 1083,
      "type" : "reshape"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "BoxPredictor_0\/BoxEncodingPredictor\/BiasAdd:0",
      "blob_weights" : 99,
      "K" : 512,
      "blob_biases" : 97,
      "name" : "BoxPredictor_0\/BoxEncodingPredictor\/convolution:0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 12,
      "bottom" : "FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_11_pointwise\/Relu6:0",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "name" : "BoxPredictor_0\/Reshape:0",
      "bottom" : "BoxPredictor_0\/BoxEncodingPredictor\/BiasAdd:0",
      "dst_n" : 0,
      "mode" : 1,
      "dst_seq" : 1,
      "dst_k" : 4,
      "weights" : {

      },
      "top" : "BoxPredictor_0\/Reshape:0",
      "dst_h" : 1,
      "dst_w" : 1083,
      "type" : "reshape"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_FeatureExtractor\/MobilenetV1\/MobilenetV1\/Conv2d_12_depthwise\/Relu6:0",
      "blob_weights" : 103,
      "K" : 512,
      "blob_biases" : 101,
      "stride_x" : 2,
